; ModuleID = 'totd.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.generic_list = type { %struct.generic_list*, %struct.generic_list*, i8* }
%struct.anon = type { %union.anon.79, i16, i16, i64 }
%union.anon.79 = type { %struct.sockaddr }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.qset = type { %struct.gqueue*, %struct.gqueue* }
%struct.gqueue = type { %struct.gqueue*, i8* }
%struct.anon.124 = type { i32, void (i32)*, void ()* }
%struct.in6_addr = type { %union.anon.1 }
%union.anon.1 = type { [4 x i32] }
%struct.ifconf = type { i32, %union.anon }
%union.anon = type { i8* }
%struct.ToT = type { i8*, i8*, i8*, i8*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [30 x [25 x i8]], %struct.generic_list*, %struct.generic_list*, i32, [31 x i8*], i32, [30 x %struct.in6_addr], [30 x %struct.in6_addr], [30 x i32] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !75, globals: !180)
!1 = !DIFile(filename: "request.c", directory: "/home/muhammad/totd/totd")
!2 = !{}
!3 = !{!4, !7, !19, !20, !26, !27, !67, !65}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 153, size: 128, align: 16, elements: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/muhammad/totd/totd")
!10 = !{!11, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !8, file: !9, line: 155, baseType: !12, size: 16, align: 16)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !13, line: 28, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/muhammad/totd/totd")
!14 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !8, file: !9, line: 156, baseType: !16, size: 112, align: 8, offset: 16)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 112, align: 8, elements: !17)
!17 = !{!18}
!18 = !DISubrange(count: 14)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !22, line: 33, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/muhammad/totd/totd")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !24, line: 30, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/muhammad/totd/totd")
!25 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "RRset", file: !29, line: 168, baseType: !30)
!29 = !DIFile(filename: "./tot_types.h", directory: "/home/muhammad/totd/totd")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "rr_set", file: !29, line: 160, size: 320, align: 64, elements: !31)
!31 = !{!32, !34, !38, !53, !54}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !30, file: !29, line: 161, baseType: !33, size: 32, align: 32)
!33 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !30, file: !29, line: 163, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 62, baseType: !37)
!36 = !DIFile(filename: "/usr/lib/llvm-3.8/bin/../lib/clang/3.8.0/include/stddef.h", directory: "/home/muhammad/totd/totd")
!37 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !30, file: !29, line: 164, baseType: !39, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_Key", file: !29, line: 143, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_union_type, name: "u_key", file: !29, line: 140, size: 64, align: 64, elements: !41)
!41 = !{!42, !52}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !40, file: !29, line: 141, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key_Info", file: !29, line: 138, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_info", file: !29, line: 134, size: 48, align: 16, elements: !46)
!46 = !{!47, !50, !51}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "r_type", scope: !45, file: !29, line: 135, baseType: !48, size: 16, align: 16)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !49, line: 49, baseType: !14)
!49 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/muhammad/totd/totd")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "r_class", scope: !45, file: !29, line: 136, baseType: !48, size: 16, align: 16, offset: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "owner_len", scope: !45, file: !29, line: 137, baseType: !48, size: 16, align: 16, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !40, file: !29, line: 142, baseType: !20, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !30, file: !29, line: 166, baseType: !35, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !29, line: 167, baseType: !55, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_Data", file: !29, line: 157, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_union_type, name: "u_data", file: !29, line: 153, size: 64, align: 64, elements: !57)
!57 = !{!58, !64, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !56, file: !29, line: 154, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "Data_Data", file: !29, line: 151, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "data_data", file: !29, line: 149, size: 16, align: 16, elements: !62)
!62 = !{!63}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data_cnt", scope: !61, file: !29, line: 150, baseType: !48, size: 16, align: 16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rt_list", scope: !56, file: !29, line: 155, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !56, file: !29, line: 156, baseType: !20, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "RR", file: !29, line: 120, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "rr", file: !29, line: 117, size: 64, align: 32, elements: !70)
!70 = !{!71, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !69, file: !29, line: 118, baseType: !72, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 51, baseType: !73)
!73 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rd_len", scope: !69, file: !29, line: 119, baseType: !48, size: 16, align: 16, offset: 32)
!75 = !{!76, !168, !171, !174, !175, !176, !177}
!76 = distinct !DISubprogram(name: "request_start", scope: !1, file: !1, line: 31, type: !77, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!77 = !DISubroutineType(types: !78)
!78 = !{!33, !79, !33}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "Context", file: !29, line: 228, baseType: !81)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "context", file: !29, line: 180, size: 3264, align: 64, elements: !82)
!82 = !{!83, !85, !86, !87, !88, !97, !98, !117, !121, !122, !126, !127, !128, !129, !130, !131, !132, !154, !155, !156, !164, !165, !166, !167}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !81, file: !29, line: 181, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !81, file: !29, line: 182, baseType: !84, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "work_state", scope: !81, file: !29, line: 185, baseType: !33, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cname_links", scope: !81, file: !29, line: 191, baseType: !33, size: 32, align: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nameservers", scope: !81, file: !29, line: 192, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !92)
!92 = !{!93, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !29, line: 19, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !29, line: 20, baseType: !94, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !91, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "current_ns", scope: !81, file: !29, line: 193, baseType: !89, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tout", scope: !81, file: !29, line: 196, baseType: !99, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "ev_to_data", file: !29, line: 244, size: 256, align: 64, elements: !101)
!101 = !{!102, !107, !111, !112}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "at", scope: !100, file: !29, line: 245, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !104, line: 75, baseType: !105)
!104 = !DIFile(filename: "/usr/include/time.h", directory: "/home/muhammad/totd/totd")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !24, line: 139, baseType: !106)
!106 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !100, file: !29, line: 246, baseType: !108, size: 64, align: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!33, !99}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !29, line: 247, baseType: !33, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !29, line: 251, baseType: !113, size: 64, align: 64, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !29, line: 248, size: 64, align: 64, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !113, file: !29, line: 249, baseType: !26, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !113, file: !29, line: 250, baseType: !84, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !81, file: !29, line: 197, baseType: !118, size: 64, align: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!33, !84}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !81, file: !29, line: 198, baseType: !118, size: 64, align: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "qname", scope: !81, file: !29, line: 201, baseType: !123, size: 2048, align: 8, offset: 512)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2048, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "q_id", scope: !81, file: !29, line: 202, baseType: !72, size: 32, align: 32, offset: 2560)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "q_class", scope: !81, file: !29, line: 203, baseType: !48, size: 16, align: 16, offset: 2592)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "q_type", scope: !81, file: !29, line: 204, baseType: !48, size: 16, align: 16, offset: 2608)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "an_list", scope: !81, file: !29, line: 207, baseType: !89, size: 64, align: 64, offset: 2624)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ns_list", scope: !81, file: !29, line: 208, baseType: !89, size: 64, align: 64, offset: 2688)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ar_list", scope: !81, file: !29, line: 209, baseType: !89, size: 64, align: 64, offset: 2752)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mesg", scope: !81, file: !29, line: 215, baseType: !133, size: 64, align: 64, offset: 2816)
!133 = !DICompositeType(tag: DW_TAG_union_type, scope: !81, file: !29, line: 212, size: 64, align: 64, elements: !134)
!134 = !{!135, !153}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !133, file: !29, line: 213, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesg_Hdr", file: !29, line: 102, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "mesg_hdr", file: !29, line: 71, size: 96, align: 16, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !29, line: 72, baseType: !48, size: 16, align: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !138, file: !29, line: 86, baseType: !21, size: 1, align: 8, offset: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !138, file: !29, line: 87, baseType: !21, size: 1, align: 8, offset: 17)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !138, file: !29, line: 88, baseType: !21, size: 1, align: 8, offset: 18)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !138, file: !29, line: 89, baseType: !21, size: 4, align: 8, offset: 19)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !138, file: !29, line: 90, baseType: !21, size: 1, align: 8, offset: 23)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !138, file: !29, line: 92, baseType: !21, size: 4, align: 8, offset: 24)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !138, file: !29, line: 93, baseType: !21, size: 3, align: 8, offset: 28)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !138, file: !29, line: 94, baseType: !21, size: 1, align: 8, offset: 31)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "qdcnt", scope: !138, file: !29, line: 98, baseType: !48, size: 16, align: 16, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ancnt", scope: !138, file: !29, line: 99, baseType: !48, size: 16, align: 16, offset: 48)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nscnt", scope: !138, file: !29, line: 100, baseType: !48, size: 16, align: 16, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "arcnt", scope: !138, file: !29, line: 101, baseType: !48, size: 16, align: 16, offset: 80)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !133, file: !29, line: 214, baseType: !20, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mesg_len", scope: !81, file: !29, line: 216, baseType: !33, size: 32, align: 32, offset: 2880)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "wp", scope: !81, file: !29, line: 217, baseType: !20, size: 64, align: 64, offset: 2944)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "netifaddr", scope: !81, file: !29, line: 220, baseType: !157, size: 64, align: 64, offset: 3008)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nia", file: !29, line: 65, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "nia", file: !29, line: 61, size: 128, align: 64, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sa_p", scope: !159, file: !29, line: 62, baseType: !7, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sock", scope: !159, file: !29, line: 63, baseType: !33, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_sock", scope: !159, file: !29, line: 64, baseType: !33, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !81, file: !29, line: 221, baseType: !48, size: 16, align: 16, offset: 3072)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !81, file: !29, line: 222, baseType: !48, size: 16, align: 16, offset: 3088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !81, file: !29, line: 225, baseType: !7, size: 64, align: 64, offset: 3136)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "conn_sock", scope: !81, file: !29, line: 227, baseType: !33, size: 32, align: 32, offset: 3200)
!168 = distinct !DISubprogram(name: "do_forward", scope: !1, file: !1, line: 155, type: !169, isLocal: false, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!169 = !DISubroutineType(types: !170)
!170 = !{!33, !84, !20, !48, !48, !33}
!171 = distinct !DISubprogram(name: "request_retry", scope: !1, file: !1, line: 225, type: !172, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!172 = !DISubroutineType(types: !173)
!173 = !{!33, !79}
!174 = distinct !DISubprogram(name: "recursive_process", scope: !1, file: !1, line: 272, type: !172, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!175 = distinct !DISubprogram(name: "request_abort", scope: !1, file: !1, line: 682, type: !77, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!176 = distinct !DISubprogram(name: "request_finish", scope: !1, file: !1, line: 703, type: !172, isLocal: false, isDefinition: true, scopeLine: 703, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!177 = distinct !DISubprogram(name: "cname_without_crecord", scope: !1, file: !1, line: 918, type: !178, isLocal: true, isDefinition: true, scopeLine: 918, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !89, !20}
!180 = !{!181}
!181 = !DIGlobalVariable(name: "buf", scope: !168, file: !1, line: 158, type: !182, isLocal: true, isDefinition: true, variable: [65535 x i8]* @do_forward.buf)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 524280, align: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 65535)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !187, globals: !281)
!186 = !DIFile(filename: "response.c", directory: "/home/muhammad/totd/totd")
!187 = !{!188, !278}
!188 = distinct !DISubprogram(name: "response_abort", scope: !186, file: !186, line: 16, type: !189, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!189 = !DISubroutineType(types: !190)
!190 = !{!33, !191, !33}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "Context", file: !29, line: 228, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "context", file: !29, line: 180, size: 3264, align: 64, elements: !194)
!194 = !{!195, !197, !198, !199, !200, !209, !210, !225, !229, !230, !231, !232, !233, !234, !235, !236, !237, !259, !260, !261, !274, !275, !276, !277}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !193, file: !29, line: 181, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !193, file: !29, line: 182, baseType: !196, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "work_state", scope: !193, file: !29, line: 185, baseType: !33, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cname_links", scope: !193, file: !29, line: 191, baseType: !33, size: 32, align: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nameservers", scope: !193, file: !29, line: 192, baseType: !201, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !204)
!204 = !{!205, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !29, line: 19, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !29, line: 20, baseType: !206, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !203, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "current_ns", scope: !193, file: !29, line: 193, baseType: !201, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tout", scope: !193, file: !29, line: 196, baseType: !211, size: 64, align: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "ev_to_data", file: !29, line: 244, size: 256, align: 64, elements: !213)
!213 = !{!214, !215, !219, !220}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "at", scope: !212, file: !29, line: 245, baseType: !103, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !212, file: !29, line: 246, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!33, !211}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !29, line: 247, baseType: !33, size: 32, align: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !29, line: 251, baseType: !221, size: 64, align: 64, offset: 192)
!221 = !DICompositeType(tag: DW_TAG_union_type, scope: !212, file: !29, line: 248, size: 64, align: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !221, file: !29, line: 249, baseType: !26, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !221, file: !29, line: 250, baseType: !196, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !193, file: !29, line: 197, baseType: !226, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!33, !196}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !193, file: !29, line: 198, baseType: !226, size: 64, align: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "qname", scope: !193, file: !29, line: 201, baseType: !123, size: 2048, align: 8, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "q_id", scope: !193, file: !29, line: 202, baseType: !72, size: 32, align: 32, offset: 2560)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "q_class", scope: !193, file: !29, line: 203, baseType: !48, size: 16, align: 16, offset: 2592)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "q_type", scope: !193, file: !29, line: 204, baseType: !48, size: 16, align: 16, offset: 2608)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "an_list", scope: !193, file: !29, line: 207, baseType: !201, size: 64, align: 64, offset: 2624)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ns_list", scope: !193, file: !29, line: 208, baseType: !201, size: 64, align: 64, offset: 2688)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ar_list", scope: !193, file: !29, line: 209, baseType: !201, size: 64, align: 64, offset: 2752)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mesg", scope: !193, file: !29, line: 215, baseType: !238, size: 64, align: 64, offset: 2816)
!238 = !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !29, line: 212, size: 64, align: 64, elements: !239)
!239 = !{!240, !258}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !238, file: !29, line: 213, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesg_Hdr", file: !29, line: 102, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "mesg_hdr", file: !29, line: 71, size: 96, align: 16, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !243, file: !29, line: 72, baseType: !48, size: 16, align: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !243, file: !29, line: 86, baseType: !21, size: 1, align: 8, offset: 16)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !243, file: !29, line: 87, baseType: !21, size: 1, align: 8, offset: 17)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !243, file: !29, line: 88, baseType: !21, size: 1, align: 8, offset: 18)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !243, file: !29, line: 89, baseType: !21, size: 4, align: 8, offset: 19)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !243, file: !29, line: 90, baseType: !21, size: 1, align: 8, offset: 23)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !243, file: !29, line: 92, baseType: !21, size: 4, align: 8, offset: 24)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !243, file: !29, line: 93, baseType: !21, size: 3, align: 8, offset: 28)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !243, file: !29, line: 94, baseType: !21, size: 1, align: 8, offset: 31)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qdcnt", scope: !243, file: !29, line: 98, baseType: !48, size: 16, align: 16, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ancnt", scope: !243, file: !29, line: 99, baseType: !48, size: 16, align: 16, offset: 48)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nscnt", scope: !243, file: !29, line: 100, baseType: !48, size: 16, align: 16, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arcnt", scope: !243, file: !29, line: 101, baseType: !48, size: 16, align: 16, offset: 80)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !238, file: !29, line: 214, baseType: !20, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mesg_len", scope: !193, file: !29, line: 216, baseType: !33, size: 32, align: 32, offset: 2880)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "wp", scope: !193, file: !29, line: 217, baseType: !20, size: 64, align: 64, offset: 2944)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "netifaddr", scope: !193, file: !29, line: 220, baseType: !262, size: 64, align: 64, offset: 3008)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nia", file: !29, line: 65, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "nia", file: !29, line: 61, size: 128, align: 64, elements: !265)
!265 = !{!266, !272, !273}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sa_p", scope: !264, file: !29, line: 62, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 153, size: 128, align: 16, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !268, file: !9, line: 155, baseType: !12, size: 16, align: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !268, file: !9, line: 156, baseType: !16, size: 112, align: 8, offset: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sock", scope: !264, file: !29, line: 63, baseType: !33, size: 32, align: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_sock", scope: !264, file: !29, line: 64, baseType: !33, size: 32, align: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !193, file: !29, line: 221, baseType: !48, size: 16, align: 16, offset: 3072)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !193, file: !29, line: 222, baseType: !48, size: 16, align: 16, offset: 3088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !193, file: !29, line: 225, baseType: !267, size: 64, align: 64, offset: 3136)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "conn_sock", scope: !193, file: !29, line: 227, baseType: !33, size: 32, align: 32, offset: 3200)
!278 = distinct !DISubprogram(name: "assemble_response", scope: !186, file: !186, line: 25, type: !279, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!279 = !DISubroutineType(types: !280)
!280 = !{!33, !191}
!281 = !{!282}
!282 = !DIGlobalVariable(name: "buf", scope: !278, file: !186, line: 27, type: !182, isLocal: true, isDefinition: true, variable: [65535 x i8]* @assemble_response.buf)
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !285, retainedTypes: !292, subprograms: !293)
!284 = !DIFile(filename: "context.c", directory: "/home/muhammad/totd/totd")
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !287, line: 52, size: 32, align: 32, elements: !288)
!287 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/socket.h", directory: "/home/muhammad/totd/totd")
!288 = !{!289, !290, !291}
!289 = !DIEnumerator(name: "SHUT_RD", value: 0)
!290 = !DIEnumerator(name: "SHUT_WR", value: 1)
!291 = !DIEnumerator(name: "SHUT_RDWR", value: 2)
!292 = !{!33, !26}
!293 = !{!294, !384, !389, !392}
!294 = distinct !DISubprogram(name: "context_timeout_handler", scope: !284, file: !284, line: 17, type: !295, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!295 = !DISubroutineType(types: !296)
!296 = !{!33, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ev_TO_Data", file: !29, line: 252, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "ev_to_data", file: !29, line: 244, size: 256, align: 64, elements: !300)
!300 = !{!301, !302, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "at", scope: !299, file: !29, line: 245, baseType: !103, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !299, file: !29, line: 246, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!33, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !29, line: 247, baseType: !33, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !299, file: !29, line: 251, baseType: !309, size: 64, align: 64, offset: 192)
!309 = !DICompositeType(tag: DW_TAG_union_type, scope: !299, file: !29, line: 248, size: 64, align: 64, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !309, file: !29, line: 249, baseType: !26, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !309, file: !29, line: 250, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "context", file: !29, line: 180, size: 3264, align: 64, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !329, !330, !331, !335, !336, !337, !338, !339, !340, !341, !342, !343, !365, !366, !367, !380, !381, !382, !383}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !314, file: !29, line: 181, baseType: !313, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !314, file: !29, line: 182, baseType: !313, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "work_state", scope: !314, file: !29, line: 185, baseType: !33, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cname_links", scope: !314, file: !29, line: 191, baseType: !33, size: 32, align: 32, offset: 160)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nameservers", scope: !314, file: !29, line: 192, baseType: !321, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !323)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !324)
!324 = !{!325, !327, !328}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !29, line: 19, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !323, file: !29, line: 20, baseType: !326, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !323, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "current_ns", scope: !314, file: !29, line: 193, baseType: !321, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tout", scope: !314, file: !29, line: 196, baseType: !306, size: 64, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !314, file: !29, line: 197, baseType: !332, size: 64, align: 64, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!33, !313}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !314, file: !29, line: 198, baseType: !332, size: 64, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "qname", scope: !314, file: !29, line: 201, baseType: !123, size: 2048, align: 8, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "q_id", scope: !314, file: !29, line: 202, baseType: !72, size: 32, align: 32, offset: 2560)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "q_class", scope: !314, file: !29, line: 203, baseType: !48, size: 16, align: 16, offset: 2592)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "q_type", scope: !314, file: !29, line: 204, baseType: !48, size: 16, align: 16, offset: 2608)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "an_list", scope: !314, file: !29, line: 207, baseType: !321, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ns_list", scope: !314, file: !29, line: 208, baseType: !321, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ar_list", scope: !314, file: !29, line: 209, baseType: !321, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mesg", scope: !314, file: !29, line: 215, baseType: !344, size: 64, align: 64, offset: 2816)
!344 = !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !29, line: 212, size: 64, align: 64, elements: !345)
!345 = !{!346, !364}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !344, file: !29, line: 213, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesg_Hdr", file: !29, line: 102, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "mesg_hdr", file: !29, line: 71, size: 96, align: 16, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !349, file: !29, line: 72, baseType: !48, size: 16, align: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !349, file: !29, line: 86, baseType: !21, size: 1, align: 8, offset: 16)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !349, file: !29, line: 87, baseType: !21, size: 1, align: 8, offset: 17)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !349, file: !29, line: 88, baseType: !21, size: 1, align: 8, offset: 18)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !349, file: !29, line: 89, baseType: !21, size: 4, align: 8, offset: 19)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !349, file: !29, line: 90, baseType: !21, size: 1, align: 8, offset: 23)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !349, file: !29, line: 92, baseType: !21, size: 4, align: 8, offset: 24)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !349, file: !29, line: 93, baseType: !21, size: 3, align: 8, offset: 28)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !349, file: !29, line: 94, baseType: !21, size: 1, align: 8, offset: 31)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "qdcnt", scope: !349, file: !29, line: 98, baseType: !48, size: 16, align: 16, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ancnt", scope: !349, file: !29, line: 99, baseType: !48, size: 16, align: 16, offset: 48)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nscnt", scope: !349, file: !29, line: 100, baseType: !48, size: 16, align: 16, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "arcnt", scope: !349, file: !29, line: 101, baseType: !48, size: 16, align: 16, offset: 80)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !344, file: !29, line: 214, baseType: !20, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mesg_len", scope: !314, file: !29, line: 216, baseType: !33, size: 32, align: 32, offset: 2880)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "wp", scope: !314, file: !29, line: 217, baseType: !20, size: 64, align: 64, offset: 2944)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "netifaddr", scope: !314, file: !29, line: 220, baseType: !368, size: 64, align: 64, offset: 3008)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nia", file: !29, line: 65, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "nia", file: !29, line: 61, size: 128, align: 64, elements: !371)
!371 = !{!372, !378, !379}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sa_p", scope: !370, file: !29, line: 62, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 153, size: 128, align: 16, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !374, file: !9, line: 155, baseType: !12, size: 16, align: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !374, file: !9, line: 156, baseType: !16, size: 112, align: 8, offset: 16)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sock", scope: !370, file: !29, line: 63, baseType: !33, size: 32, align: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_sock", scope: !370, file: !29, line: 64, baseType: !33, size: 32, align: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !314, file: !29, line: 221, baseType: !48, size: 16, align: 16, offset: 3072)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !314, file: !29, line: 222, baseType: !48, size: 16, align: 16, offset: 3088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !314, file: !29, line: 225, baseType: !373, size: 64, align: 64, offset: 3136)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "conn_sock", scope: !314, file: !29, line: 227, baseType: !33, size: 32, align: 32, offset: 3200)
!384 = distinct !DISubprogram(name: "context_timeout_register", scope: !284, file: !284, line: 27, type: !385, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!385 = !DISubroutineType(types: !386)
!386 = !{!33, !387, !33}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Context", file: !29, line: 228, baseType: !314)
!389 = distinct !DISubprogram(name: "context_create", scope: !284, file: !284, line: 60, type: !390, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!390 = !DISubroutineType(types: !391)
!391 = !{!387}
!392 = distinct !DISubprogram(name: "context_destroy", scope: !284, file: !284, line: 89, type: !393, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!393 = !DISubroutineType(types: !394)
!394 = !{!26, !387}
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !397, subprograms: !469, globals: !529)
!396 = !DIFile(filename: "ne_mesg.c", directory: "/home/muhammad/totd/totd")
!397 = !{!398, !399, !20, !35, !4, !416, !448, !65, !33, !48, !19, !454, !26}
!398 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesg_Hdr", file: !29, line: 102, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "mesg_hdr", file: !29, line: 71, size: 96, align: 16, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !401, file: !29, line: 72, baseType: !48, size: 16, align: 16)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !401, file: !29, line: 86, baseType: !21, size: 1, align: 8, offset: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !401, file: !29, line: 87, baseType: !21, size: 1, align: 8, offset: 17)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !401, file: !29, line: 88, baseType: !21, size: 1, align: 8, offset: 18)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !401, file: !29, line: 89, baseType: !21, size: 4, align: 8, offset: 19)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !401, file: !29, line: 90, baseType: !21, size: 1, align: 8, offset: 23)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !401, file: !29, line: 92, baseType: !21, size: 4, align: 8, offset: 24)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !401, file: !29, line: 93, baseType: !21, size: 3, align: 8, offset: 28)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !401, file: !29, line: 94, baseType: !21, size: 1, align: 8, offset: 31)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "qdcnt", scope: !401, file: !29, line: 98, baseType: !48, size: 16, align: 16, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ancnt", scope: !401, file: !29, line: 99, baseType: !48, size: 16, align: 16, offset: 48)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nscnt", scope: !401, file: !29, line: 100, baseType: !48, size: 16, align: 16, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "arcnt", scope: !401, file: !29, line: 101, baseType: !48, size: 16, align: 16, offset: 80)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "RRset", file: !29, line: 168, baseType: !418)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "rr_set", file: !29, line: 160, size: 320, align: 64, elements: !419)
!419 = !{!420, !421, !422, !435, !436}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !418, file: !29, line: 161, baseType: !33, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !418, file: !29, line: 163, baseType: !35, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !418, file: !29, line: 164, baseType: !423, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_Key", file: !29, line: 143, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_union_type, name: "u_key", file: !29, line: 140, size: 64, align: 64, elements: !425)
!425 = !{!426, !434}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !424, file: !29, line: 141, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key_Info", file: !29, line: 138, baseType: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_info", file: !29, line: 134, size: 48, align: 16, elements: !430)
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "r_type", scope: !429, file: !29, line: 135, baseType: !48, size: 16, align: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "r_class", scope: !429, file: !29, line: 136, baseType: !48, size: 16, align: 16, offset: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "owner_len", scope: !429, file: !29, line: 137, baseType: !48, size: 16, align: 16, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !424, file: !29, line: 142, baseType: !20, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !418, file: !29, line: 166, baseType: !35, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !29, line: 167, baseType: !437, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_Data", file: !29, line: 157, baseType: !438)
!438 = !DICompositeType(tag: DW_TAG_union_type, name: "u_data", file: !29, line: 153, size: 64, align: 64, elements: !439)
!439 = !{!440, !446, !447}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !438, file: !29, line: 154, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Data_Data", file: !29, line: 151, baseType: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "data_data", file: !29, line: 149, size: 16, align: 16, elements: !444)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data_cnt", scope: !443, file: !29, line: 150, baseType: !48, size: 16, align: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rt_list", scope: !438, file: !29, line: 155, baseType: !65, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !438, file: !29, line: 156, baseType: !20, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "RR", file: !29, line: 120, baseType: !450)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "rr", file: !29, line: 117, size: 64, align: 32, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !450, file: !29, line: 118, baseType: !72, size: 32, align: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rd_len", scope: !450, file: !29, line: 119, baseType: !48, size: 16, align: 16, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "RRset_Couple", file: !29, line: 174, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 171, size: 128, align: 64, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rrs", scope: !456, file: !29, line: 172, baseType: !416, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rrl", scope: !456, file: !29, line: 173, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "RR_List", file: !29, line: 128, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "rr_list", file: !29, line: 123, size: 192, align: 64, elements: !463)
!463 = !{!464, !466, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !29, line: 124, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !462, file: !29, line: 125, baseType: !33, size: 32, align: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !462, file: !29, line: 126, baseType: !33, size: 32, align: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rrp", scope: !462, file: !29, line: 127, baseType: !448, size: 64, align: 64, offset: 128)
!469 = !{!470, !473, !476, !479, !484, !487, !490, !502, !505, !508, !511, !515, !518, !519, !522, !523, !526}
!470 = distinct !DISubprogram(name: "make_random_permutation", scope: !396, file: !396, line: 36, type: !471, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !33}
!473 = distinct !DISubprogram(name: "mesg_id", scope: !396, file: !396, line: 51, type: !474, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!474 = !DISubroutineType(types: !475)
!475 = !{!48}
!476 = distinct !DISubprogram(name: "mesg_make_query", scope: !396, file: !396, line: 79, type: !477, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!477 = !DISubroutineType(types: !478)
!478 = !{!33, !20, !48, !48, !72, !33, !20, !33}
!479 = distinct !DISubprogram(name: "labellen", scope: !396, file: !396, line: 130, type: !480, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!480 = !DISubroutineType(types: !481)
!481 = !{!33, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!484 = distinct !DISubprogram(name: "mesg_skip_dname", scope: !396, file: !396, line: 151, type: !485, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!485 = !DISubroutineType(types: !486)
!486 = !{!20, !20, !20}
!487 = distinct !DISubprogram(name: "mesg_dname_cmp", scope: !396, file: !396, line: 177, type: !488, isLocal: false, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!488 = !DISubroutineType(types: !489)
!489 = !{!33, !20, !20, !20}
!490 = distinct !DISubprogram(name: "mesg_write_rrset_list", scope: !396, file: !396, line: 209, type: !491, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!491 = !DISubroutineType(types: !492)
!492 = !{!33, !493, !20, !20, !65, !33, !501, !65}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !495)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !496)
!496 = !{!497, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !29, line: 19, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !495, file: !29, line: 20, baseType: !498, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !495, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!502 = distinct !DISubprogram(name: "mesg_assemble", scope: !396, file: !396, line: 285, type: !503, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!503 = !DISubroutineType(types: !504)
!504 = !{!33, !493, !493, !493, !20, !48, !20, !33}
!505 = distinct !DISubprogram(name: "mesg_extract_rr", scope: !396, file: !396, line: 380, type: !506, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!506 = !DISubroutineType(types: !507)
!507 = !{!33, !20, !20, !48, !48, !20, !20, !33}
!508 = distinct !DISubprogram(name: "mesg_parse", scope: !396, file: !396, line: 470, type: !509, isLocal: false, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!509 = !DISubroutineType(types: !510)
!510 = !{!33, !20, !33, !493, !493, !493}
!511 = distinct !DISubprogram(name: "dname_decompress", scope: !396, file: !396, line: 508, type: !512, isLocal: false, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!512 = !DISubroutineType(types: !513)
!513 = !{!20, !20, !33, !20, !20, !20, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!515 = distinct !DISubprogram(name: "string_rclass", scope: !396, file: !396, line: 605, type: !516, isLocal: false, isDefinition: true, scopeLine: 605, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!516 = !DISubroutineType(types: !517)
!517 = !{!19, !48}
!518 = distinct !DISubprogram(name: "string_rtype", scope: !396, file: !396, line: 619, type: !516, isLocal: false, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!519 = distinct !DISubprogram(name: "dname_copy", scope: !396, file: !396, line: 679, type: !520, isLocal: true, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!520 = !DISubroutineType(types: !521)
!521 = !{!33, !20, !20, !33}
!522 = distinct !DISubprogram(name: "dname_redirect", scope: !396, file: !396, line: 702, type: !485, isLocal: true, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!523 = distinct !DISubprogram(name: "write_dname", scope: !396, file: !396, line: 713, type: !524, isLocal: true, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!524 = !DISubroutineType(types: !525)
!525 = !{!33, !20, !20, !65, !33, !20, !20}
!526 = distinct !DISubprogram(name: "mesg_read_sec", scope: !396, file: !396, line: 864, type: !527, isLocal: true, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!527 = !DISubroutineType(types: !528)
!528 = !{!20, !493, !20, !33, !20, !33}
!529 = !{!530, !531, !532}
!530 = !DIGlobalVariable(name: "range", scope: !473, file: !396, line: 52, type: !33, isLocal: true, isDefinition: true, variable: i32* @mesg_id.range)
!531 = !DIGlobalVariable(name: "index", scope: !473, file: !396, line: 53, type: !33, isLocal: true, isDefinition: true, variable: i32* @mesg_id.index)
!532 = !DIGlobalVariable(name: "permutation", scope: !395, file: !396, line: 32, type: !533, isLocal: true, isDefinition: true, variable: [32768 x i16]* @permutation)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 524288, align: 16, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 32768)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !538, retainedTypes: !554, subprograms: !587)
!537 = !DIFile(filename: "conv_trick.c", directory: "/home/muhammad/totd/totd")
!538 = !{!539}
!539 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !540, line: 46, size: 32, align: 32, elements: !541)
!540 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/muhammad/totd/totd")
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!542 = !DIEnumerator(name: "_ISupper", value: 256)
!543 = !DIEnumerator(name: "_ISlower", value: 512)
!544 = !DIEnumerator(name: "_ISalpha", value: 1024)
!545 = !DIEnumerator(name: "_ISdigit", value: 2048)
!546 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!547 = !DIEnumerator(name: "_ISspace", value: 8192)
!548 = !DIEnumerator(name: "_ISprint", value: 16384)
!549 = !DIEnumerator(name: "_ISgraph", value: 32768)
!550 = !DIEnumerator(name: "_ISblank", value: 1)
!551 = !DIEnumerator(name: "_IScntrl", value: 2)
!552 = !DIEnumerator(name: "_ISpunct", value: 4)
!553 = !DIEnumerator(name: "_ISalnum", value: 8)
!554 = !{!26, !555, !19, !20, !4, !33, !14}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "RRset", file: !29, line: 168, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "rr_set", file: !29, line: 160, size: 320, align: 64, elements: !558)
!558 = !{!559, !560, !561, !574, !575}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !557, file: !29, line: 161, baseType: !33, size: 32, align: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !557, file: !29, line: 163, baseType: !35, size: 64, align: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !557, file: !29, line: 164, baseType: !562, size: 64, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_Key", file: !29, line: 143, baseType: !563)
!563 = !DICompositeType(tag: DW_TAG_union_type, name: "u_key", file: !29, line: 140, size: 64, align: 64, elements: !564)
!564 = !{!565, !573}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !563, file: !29, line: 141, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Key_Info", file: !29, line: 138, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "key_info", file: !29, line: 134, size: 48, align: 16, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "r_type", scope: !568, file: !29, line: 135, baseType: !48, size: 16, align: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "r_class", scope: !568, file: !29, line: 136, baseType: !48, size: 16, align: 16, offset: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "owner_len", scope: !568, file: !29, line: 137, baseType: !48, size: 16, align: 16, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !563, file: !29, line: 142, baseType: !20, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !557, file: !29, line: 166, baseType: !35, size: 64, align: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !557, file: !29, line: 167, baseType: !576, size: 64, align: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "U_Data", file: !29, line: 157, baseType: !577)
!577 = !DICompositeType(tag: DW_TAG_union_type, name: "u_data", file: !29, line: 153, size: 64, align: 64, elements: !578)
!578 = !{!579, !585, !586}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !577, file: !29, line: 154, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "Data_Data", file: !29, line: 151, baseType: !582)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "data_data", file: !29, line: 149, size: 16, align: 16, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data_cnt", scope: !582, file: !29, line: 150, baseType: !48, size: 16, align: 16)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rt_list", scope: !577, file: !29, line: 155, baseType: !65, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !577, file: !29, line: 156, baseType: !20, size: 64, align: 64)
!587 = !{!588, !599, !602, !603, !606, !607, !610, !633, !636, !639}
!588 = distinct !DISubprogram(name: "conv_trick_list", scope: !537, file: !537, line: 90, type: !589, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !591, !33, !33}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !594)
!594 = !{!595, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !593, file: !29, line: 19, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !593, file: !29, line: 20, baseType: !596, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !593, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!599 = distinct !DISubprogram(name: "conv_trick_ptr", scope: !537, file: !537, line: 150, type: !600, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !591, !20}
!602 = distinct !DISubprogram(name: "conv_trick_newptr", scope: !537, file: !537, line: 182, type: !600, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!603 = distinct !DISubprogram(name: "conv_trick_conf", scope: !537, file: !537, line: 218, type: !604, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!604 = !DISubroutineType(types: !605)
!605 = !{!33, !20}
!606 = distinct !DISubprogram(name: "conv_trick_is_tot_ptr", scope: !537, file: !537, line: 242, type: !604, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!607 = distinct !DISubprogram(name: "conv_trick_ptr_rq", scope: !537, file: !537, line: 289, type: !608, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !20}
!610 = distinct !DISubprogram(name: "conv_trick_is_tot_newptr", scope: !537, file: !537, line: 325, type: !611, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!611 = !DISubroutineType(types: !612)
!612 = !{!33, !20, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !615, line: 211, size: 128, align: 32, elements: !616)
!615 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/muhammad/totd/totd")
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !614, file: !615, line: 220, baseType: !618, size: 128, align: 32)
!618 = !DICompositeType(tag: DW_TAG_union_type, scope: !614, file: !615, line: 213, size: 128, align: 32, elements: !619)
!619 = !{!620, !625, !629}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !618, file: !615, line: 215, baseType: !621, size: 128, align: 8)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 128, align: 8, elements: !623)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !49, line: 48, baseType: !25)
!623 = !{!624}
!624 = !DISubrange(count: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !618, file: !615, line: 217, baseType: !626, size: 128, align: 16)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, align: 16, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !618, file: !615, line: 218, baseType: !630, size: 128, align: 32)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, align: 32, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 4)
!633 = distinct !DISubprogram(name: "conv_trick_newptr_rq", scope: !537, file: !537, line: 372, type: !634, isLocal: false, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !20, !613}
!636 = distinct !DISubprogram(name: "search_name", scope: !537, file: !537, line: 396, type: !637, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!637 = !DISubroutineType(types: !638)
!638 = !{!555, !591, !19, !33, !33}
!639 = distinct !DISubprogram(name: "conv_trick_rrset", scope: !537, file: !537, line: 18, type: !640, isLocal: true, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!640 = !DISubroutineType(types: !641)
!641 = !{!555, !555, !48, !33}
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !644, subprograms: !740, globals: !786)
!643 = !DIFile(filename: "ev_tcp.c", directory: "/home/muhammad/totd/totd")
!644 = !{!645, !26, !650, !738, !33}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 153, size: 128, align: 16, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !646, file: !9, line: 155, baseType: !12, size: 16, align: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !646, file: !9, line: 156, baseType: !16, size: 112, align: 8, offset: 16)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ev_TCP_Common_Data", file: !29, line: 241, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "ev_tcp_common_data", file: !29, line: 238, size: 128, align: 64, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !652, file: !29, line: 239, baseType: !33, size: 32, align: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cptr", scope: !652, file: !29, line: 240, baseType: !656, size: 64, align: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "Context", file: !29, line: 228, baseType: !658)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "context", file: !29, line: 180, size: 3264, align: 64, elements: !659)
!659 = !{!660, !662, !663, !664, !665, !674, !675, !690, !694, !695, !696, !697, !698, !699, !700, !701, !702, !724, !725, !726, !734, !735, !736, !737}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !658, file: !29, line: 181, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !658, file: !29, line: 182, baseType: !661, size: 64, align: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "work_state", scope: !658, file: !29, line: 185, baseType: !33, size: 32, align: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cname_links", scope: !658, file: !29, line: 191, baseType: !33, size: 32, align: 32, offset: 160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nameservers", scope: !658, file: !29, line: 192, baseType: !666, size: 64, align: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !668)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !669)
!669 = !{!670, !672, !673}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !668, file: !29, line: 19, baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !668, file: !29, line: 20, baseType: !671, size: 64, align: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !668, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "current_ns", scope: !658, file: !29, line: 193, baseType: !666, size: 64, align: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tout", scope: !658, file: !29, line: 196, baseType: !676, size: 64, align: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "ev_to_data", file: !29, line: 244, size: 256, align: 64, elements: !678)
!678 = !{!679, !680, !684, !685}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "at", scope: !677, file: !29, line: 245, baseType: !103, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !677, file: !29, line: 246, baseType: !681, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!33, !676}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !29, line: 247, baseType: !33, size: 32, align: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !29, line: 251, baseType: !686, size: 64, align: 64, offset: 192)
!686 = !DICompositeType(tag: DW_TAG_union_type, scope: !677, file: !29, line: 248, size: 64, align: 64, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !686, file: !29, line: 249, baseType: !26, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !686, file: !29, line: 250, baseType: !661, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !658, file: !29, line: 197, baseType: !691, size: 64, align: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!33, !661}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !658, file: !29, line: 198, baseType: !691, size: 64, align: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "qname", scope: !658, file: !29, line: 201, baseType: !123, size: 2048, align: 8, offset: 512)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "q_id", scope: !658, file: !29, line: 202, baseType: !72, size: 32, align: 32, offset: 2560)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "q_class", scope: !658, file: !29, line: 203, baseType: !48, size: 16, align: 16, offset: 2592)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "q_type", scope: !658, file: !29, line: 204, baseType: !48, size: 16, align: 16, offset: 2608)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "an_list", scope: !658, file: !29, line: 207, baseType: !666, size: 64, align: 64, offset: 2624)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ns_list", scope: !658, file: !29, line: 208, baseType: !666, size: 64, align: 64, offset: 2688)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ar_list", scope: !658, file: !29, line: 209, baseType: !666, size: 64, align: 64, offset: 2752)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "mesg", scope: !658, file: !29, line: 215, baseType: !703, size: 64, align: 64, offset: 2816)
!703 = !DICompositeType(tag: DW_TAG_union_type, scope: !658, file: !29, line: 212, size: 64, align: 64, elements: !704)
!704 = !{!705, !723}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !703, file: !29, line: 213, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesg_Hdr", file: !29, line: 102, baseType: !708)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "mesg_hdr", file: !29, line: 71, size: 96, align: 16, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !708, file: !29, line: 72, baseType: !48, size: 16, align: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !708, file: !29, line: 86, baseType: !21, size: 1, align: 8, offset: 16)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !708, file: !29, line: 87, baseType: !21, size: 1, align: 8, offset: 17)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !708, file: !29, line: 88, baseType: !21, size: 1, align: 8, offset: 18)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !708, file: !29, line: 89, baseType: !21, size: 4, align: 8, offset: 19)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !708, file: !29, line: 90, baseType: !21, size: 1, align: 8, offset: 23)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !708, file: !29, line: 92, baseType: !21, size: 4, align: 8, offset: 24)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !708, file: !29, line: 93, baseType: !21, size: 3, align: 8, offset: 28)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !708, file: !29, line: 94, baseType: !21, size: 1, align: 8, offset: 31)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "qdcnt", scope: !708, file: !29, line: 98, baseType: !48, size: 16, align: 16, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ancnt", scope: !708, file: !29, line: 99, baseType: !48, size: 16, align: 16, offset: 48)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nscnt", scope: !708, file: !29, line: 100, baseType: !48, size: 16, align: 16, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "arcnt", scope: !708, file: !29, line: 101, baseType: !48, size: 16, align: 16, offset: 80)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !703, file: !29, line: 214, baseType: !20, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mesg_len", scope: !658, file: !29, line: 216, baseType: !33, size: 32, align: 32, offset: 2880)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "wp", scope: !658, file: !29, line: 217, baseType: !20, size: 64, align: 64, offset: 2944)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "netifaddr", scope: !658, file: !29, line: 220, baseType: !727, size: 64, align: 64, offset: 3008)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nia", file: !29, line: 65, baseType: !729)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "nia", file: !29, line: 61, size: 128, align: 64, elements: !730)
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sa_p", scope: !729, file: !29, line: 62, baseType: !645, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "udp_sock", scope: !729, file: !29, line: 63, baseType: !33, size: 32, align: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_sock", scope: !729, file: !29, line: 64, baseType: !33, size: 32, align: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !658, file: !29, line: 221, baseType: !48, size: 16, align: 16, offset: 3072)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !658, file: !29, line: 222, baseType: !48, size: 16, align: 16, offset: 3088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !658, file: !29, line: 225, baseType: !645, size: 64, align: 64, offset: 3136)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "conn_sock", scope: !658, file: !29, line: 227, baseType: !33, size: 32, align: 32, offset: 3200)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !739, line: 54, baseType: !106)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/muhammad/totd/totd")
!740 = !{!741, !744, !747, !750, !753, !756, !765, !766, !769, !772, !775, !776, !779, !780, !781, !782, !783, !784, !785}
!741 = distinct !DISubprogram(name: "ev_tcp_srv_accept", scope: !643, file: !643, line: 24, type: !742, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!742 = !DISubroutineType(types: !743)
!743 = !{!33, !33}
!744 = distinct !DISubprogram(name: "ev_tcp_common_eq", scope: !643, file: !643, line: 46, type: !745, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!745 = !DISubroutineType(types: !746)
!746 = !{!33, !26, !26}
!747 = distinct !DISubprogram(name: "ev_tcp_common_init", scope: !643, file: !643, line: 59, type: !748, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!748 = !DISubroutineType(types: !749)
!749 = !{!666}
!750 = distinct !DISubprogram(name: "ev_tcp_common_register", scope: !643, file: !643, line: 70, type: !751, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!751 = !DISubroutineType(types: !752)
!752 = !{!33, !666, !33, !656}
!753 = distinct !DISubprogram(name: "ev_tcp_common_remove", scope: !643, file: !643, line: 90, type: !754, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!754 = !DISubroutineType(types: !755)
!755 = !{!33, !666, !33}
!756 = distinct !DISubprogram(name: "ev_tcp_common_fds", scope: !643, file: !643, line: 112, type: !757, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!757 = !DISubroutineType(types: !758)
!758 = !{!33, !666, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !739, line: 75, baseType: !761)
!761 = !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 64, size: 1024, align: 64, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !761, file: !739, line: 72, baseType: !764, size: 1024, align: 64)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 1024, align: 64, elements: !623)
!765 = distinct !DISubprogram(name: "ev_tcp_common_fd_check", scope: !643, file: !643, line: 130, type: !757, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!766 = distinct !DISubprogram(name: "ev_tcp_conn_in_init", scope: !643, file: !643, line: 160, type: !767, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!767 = !DISubroutineType(types: !768)
!768 = !{!33}
!769 = distinct !DISubprogram(name: "ev_tcp_conn_in_finish", scope: !643, file: !643, line: 170, type: !770, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!770 = !DISubroutineType(types: !771)
!771 = !{null}
!772 = distinct !DISubprogram(name: "ev_tcp_conn_in_register", scope: !643, file: !643, line: 174, type: !773, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!773 = !DISubroutineType(types: !774)
!774 = !{!33, !33, !656}
!775 = distinct !DISubprogram(name: "ev_tcp_conn_in_remove", scope: !643, file: !643, line: 180, type: !742, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!776 = distinct !DISubprogram(name: "ev_tcp_conn_in_fds", scope: !643, file: !643, line: 186, type: !777, isLocal: false, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!777 = !DISubroutineType(types: !778)
!778 = !{!33, !759}
!779 = distinct !DISubprogram(name: "ev_tcp_conn_in_fd_check", scope: !643, file: !643, line: 192, type: !777, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!780 = distinct !DISubprogram(name: "ev_tcp_out_init", scope: !643, file: !643, line: 202, type: !767, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!781 = distinct !DISubprogram(name: "ev_tcp_out_finish", scope: !643, file: !643, line: 214, type: !770, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!782 = distinct !DISubprogram(name: "ev_tcp_out_register", scope: !643, file: !643, line: 218, type: !773, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!783 = distinct !DISubprogram(name: "ev_tcp_out_remove", scope: !643, file: !643, line: 224, type: !742, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!784 = distinct !DISubprogram(name: "ev_tcp_out_fds", scope: !643, file: !643, line: 230, type: !777, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!785 = distinct !DISubprogram(name: "ev_tcp_out_fd_check", scope: !643, file: !643, line: 236, type: !777, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!786 = !{!787, !788}
!787 = !DIGlobalVariable(name: "ConnL_head", scope: !642, file: !643, line: 17, type: !666, isLocal: true, isDefinition: true, variable: %struct.generic_list** @ConnL_head)
!788 = !DIGlobalVariable(name: "ETOL_head", scope: !642, file: !643, line: 18, type: !666, isLocal: true, isDefinition: true, variable: %struct.generic_list** @ETOL_head)
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 3.8.0-2ubuntu4 (tags/RELEASE_380/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !791, retainedTypes: !804, subprograms: !854)
!790 = !DIFile(filename: "forward.c", directory: "/home/muhammad/totd/totd")
!791 = !{!792}
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !793, line: 24, size: 32, align: 32, elements: !794)
!793 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/muhammad/totd/totd")
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803}
!795 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!796 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!797 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!798 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!799 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!800 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!801 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!802 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!803 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!804 = !{!805, !26, !818, !834, !103, !852}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !615, line: 239, size: 128, align: 32, elements: !807)
!807 = !{!808, !809, !811, !816}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !806, file: !615, line: 241, baseType: !12, size: 16, align: 16)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !806, file: !615, line: 242, baseType: !810, size: 16, align: 16, offset: 16)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !615, line: 119, baseType: !48)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !806, file: !615, line: 243, baseType: !812, size: 32, align: 32, offset: 32)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !615, line: 31, size: 32, align: 32, elements: !813)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !812, file: !615, line: 33, baseType: !815, size: 32, align: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !615, line: 30, baseType: !72)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !806, file: !615, line: 246, baseType: !817, size: 64, align: 8, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, align: 8, elements: !627)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !615, line: 254, size: 224, align: 32, elements: !820)
!820 = !{!821, !822, !823, !824, !833}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !819, file: !615, line: 256, baseType: !12, size: 16, align: 16)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !819, file: !615, line: 257, baseType: !810, size: 16, align: 16, offset: 16)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !819, file: !615, line: 258, baseType: !72, size: 32, align: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !819, file: !615, line: 259, baseType: !825, size: 128, align: 32, offset: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !615, line: 211, size: 128, align: 32, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !825, file: !615, line: 220, baseType: !828, size: 128, align: 32)
!828 = !DICompositeType(tag: DW_TAG_union_type, scope: !825, file: !615, line: 213, size: 128, align: 32, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !828, file: !615, line: 215, baseType: !621, size: 128, align: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !828, file: !615, line: 217, baseType: !626, size: 128, align: 16)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !828, file: !615, line: 218, baseType: !630, size: 128, align: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !819, file: !615, line: 260, baseType: !72, size: 32, align: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64, align: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "Fwd", file: !29, line: 55, baseType: !836)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "fwd", file: !29, line: 44, size: 2368, align: 64, elements: !837)
!837 = !{!838, !842, !843, !849, !850, !851}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !836, file: !29, line: 45, baseType: !839, size: 2056, align: 8)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 2056, align: 8, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 257)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !836, file: !29, line: 46, baseType: !33, size: 32, align: 32, offset: 2080)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !836, file: !29, line: 47, baseType: !844, size: 64, align: 64, offset: 2112)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 153, size: 128, align: 16, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !845, file: !9, line: 155, baseType: !12, size: 16, align: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !845, file: !9, line: 156, baseType: !16, size: 112, align: 8, offset: 16)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sa_len", scope: !836, file: !29, line: 48, baseType: !33, size: 32, align: 32, offset: 2176)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "went_down_at", scope: !836, file: !29, line: 53, baseType: !103, size: 64, align: 64, offset: 2240)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !836, file: !29, line: 54, baseType: !33, size: 32, align: 32, offset: 2304)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!854 = !{!855, !858, !861, !864, !867, !870, !871, !874, !931, !934}
!855 = distinct !DISubprogram(name: "sprint_inet", scope: !790, file: !790, line: 16, type: !856, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!856 = !DISubroutineType(types: !857)
!857 = !{!19, !844, !19}
!858 = distinct !DISubprogram(name: "parse_and_alloc_addr", scope: !790, file: !790, line: 41, type: !859, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!859 = !DISubroutineType(types: !860)
!860 = !{!844, !19, !33, !514}
!861 = distinct !DISubprogram(name: "fwd_free", scope: !790, file: !790, line: 123, type: !862, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !834}
!864 = distinct !DISubprogram(name: "fwd_freev", scope: !790, file: !790, line: 133, type: !865, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !26}
!867 = distinct !DISubprogram(name: "fwd_alloc", scope: !790, file: !790, line: 138, type: !868, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!868 = !DISubroutineType(types: !869)
!869 = !{!834}
!870 = distinct !DISubprogram(name: "fwd_init", scope: !790, file: !790, line: 160, type: !770, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!871 = distinct !DISubprogram(name: "fwd_add", scope: !790, file: !790, line: 190, type: !872, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!872 = !DISubroutineType(types: !873)
!873 = !{!33, !19, !33}
!874 = distinct !DISubprogram(name: "fwd_select", scope: !790, file: !790, line: 215, type: !875, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !877}
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "ToT", file: !878, line: 95, size: 17728, align: 64, elements: !879)
!878 = !DIFile(filename: "./totd.h", directory: "/home/muhammad/totd/totd")
!879 = !{!880, !881, !882, !883, !884, !885, !888, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !909, !918, !919, !920, !924, !925, !928, !929}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "configfile", scope: !877, file: !878, line: 97, baseType: !19, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !877, file: !878, line: 98, baseType: !19, size: 64, align: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !877, file: !878, line: 100, baseType: !19, size: 64, align: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !877, file: !878, line: 101, baseType: !19, size: 64, align: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rootdir", scope: !877, file: !878, line: 102, baseType: !19, size: 64, align: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !877, file: !878, line: 103, baseType: !886, size: 32, align: 32, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !22, line: 80, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !24, line: 125, baseType: !73)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !877, file: !878, line: 104, baseType: !889, size: 32, align: 32, offset: 352)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !22, line: 65, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !24, line: 126, baseType: !73)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !877, file: !878, line: 106, baseType: !33, size: 32, align: 32, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !877, file: !878, line: 107, baseType: !33, size: 32, align: 32, offset: 416)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !877, file: !878, line: 108, baseType: !33, size: 32, align: 32, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "retry_interval", scope: !877, file: !878, line: 109, baseType: !33, size: 32, align: 32, offset: 480)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "http_port", scope: !877, file: !878, line: 110, baseType: !33, size: 32, align: 32, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !877, file: !878, line: 112, baseType: !33, size: 32, align: 32, offset: 544)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !877, file: !878, line: 113, baseType: !33, size: 32, align: 32, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "use_mapped", scope: !877, file: !878, line: 114, baseType: !33, size: 32, align: 32, offset: 608)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "wildcard", scope: !877, file: !878, line: 115, baseType: !33, size: 32, align: 32, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "stf", scope: !877, file: !878, line: 116, baseType: !33, size: 32, align: 32, offset: 672)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tcp", scope: !877, file: !878, line: 117, baseType: !33, size: 32, align: 32, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rescan_iflist", scope: !877, file: !878, line: 118, baseType: !33, size: 32, align: 32, offset: 736)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "prefixnum", scope: !877, file: !878, line: 120, baseType: !33, size: 32, align: 32, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !877, file: !878, line: 121, baseType: !905, size: 6000, align: 8, offset: 800)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 6000, align: 8, elements: !906)
!906 = !{!907, !908}
!907 = !DISubrange(count: 30)
!908 = !DISubrange(count: 25)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Fwd_list", scope: !877, file: !878, line: 123, baseType: !910, size: 64, align: 64, offset: 6848)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "G_List", file: !29, line: 22, baseType: !912)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "generic_list", file: !29, line: 18, size: 192, align: 64, elements: !913)
!913 = !{!914, !916, !917}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !29, line: 19, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !912, file: !29, line: 20, baseType: !915, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "list_data", scope: !912, file: !29, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "current_fwd", scope: !877, file: !878, line: 125, baseType: !910, size: 64, align: 64, offset: 6912)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "current_prefix", scope: !877, file: !878, line: 126, baseType: !33, size: 32, align: 32, offset: 6976)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "iflist", scope: !877, file: !878, line: 127, baseType: !921, size: 1984, align: 64, offset: 7040)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1984, align: 64, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 31)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "scoped_prefixes", scope: !877, file: !878, line: 130, baseType: !33, size: 32, align: 32, offset: 9024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "scoped_from", scope: !877, file: !878, line: 131, baseType: !926, size: 3840, align: 32, offset: 9056)
